print(3.141592)
print("Hello World")
print((7+15)*2)
print(2**10*5)
print("Computer"+"Science")
print("Computer"*2)

"""
# 들여쓰기 Error
print("Python is Fun")
    print("Python is Fun")

파이썬은 들여쓰기가 매우 중요함
따라서 함부로 들여쓰기를 하면 안됨.
왜냐하면 들여쓰기가 되어 있는 경우 그 코드가 해당부분에 속함을 의미하게 되므로
if문, for문 등의 반복문, 조건문 등에 사용이 됨

"""

# 주석의 필요성
print((4.5*2 + 4.0*3)/2)

"""
위 처럼 단순히 코드를 작성해 놓으면 나중에 왜 내가 이것을 작성했지? 어떠한 용도이지? 등과 같은 이유로 필요하고,
또한 다른 사람들과 같이 협업을 할 때, 더 용이하게 코드 수정을 하기 위함이다.
"""

# 학점 계산 코드, (성적*학점 + 성적*학점)/총 과목 수
print((4.5*2 + 4.0*3)/2)
